/**
 * @author wangling
 * @date 2021-9-15
 * <p>
 * DDD: 目录
 * 它本身不绑定到任何一种具体的架构风格，可以应用在多种不同的架构风格中。本文探讨在经典的分层架构中如何应用DDD，以及在DDD的语境下，分层结构每一层的具体职责。
 * 分层架构是企业应用开发中采用率非常高的一种架构风格。它将软件系统的不同职责划分到不同的逻辑层中，并严格定义这些逻辑层的调用顺序。
 * 相关知识参考：https://zhuanlan.zhihu.com/p/135944454
 * 本例DDD包括四层结构：
 *
 * 展示层(user-interfaces):    为外部用户访问底层系统提供交互界面和数据表示。在底层系统之上封装了一层可访问外壳，为特定类型的外部用户（人或计算机程序）访问底层系统提供访问入口，并将底层系统的状态数据以该类型客户需要的形式呈现给它们。
 * 应用层(application):     应用层定义系统的业务功能，并指挥领域层中的领域对象实现这些功能。应用层本身不实现业务，它封装领域层的复杂性并隐藏了其内部实现机制。
 * 领域层（domain）:         领域层实现业务逻辑
 * 基础层(infrastructure):  基础设施层为其余各层提供技术支持。如数据存储，消息发送，外部系统交互，通用基础工具类，数据转换等
 *
 **/
package com.ddd.demo.ddd;
